TerrienDJV5/Netogatchi-ESP32-V1/Software/tamagotchi_V0.0.0_for_Hardware_V1/tamagotchi_V0.0.0_for_Hardware_V1.ino
//BatterySensePin
#define batteryVoltageDivider 36//GPIO 36 //ADC1_CH0





//I2C Display
#define OLED_SDA 21 //I2C SDA
#define OLED_SCL 22 //I2C SCL

//UART
//U0UXD is generally used to communicate with the ESP32 for programming and during reset/boot.
#define UART0_TX_Pin 1//Used for Programing Board
#define UART0_RX_Pin 3//Used for Programing Board

//U1UXD is unused and can be used for your projects. Some boards use this port for SPI Flash access though!
#define UART1_TX_Pin 10
#define UART1_RX_Pin 9

//U2UXD is unused and can be used for your projects.
#define UART2_TX_Pin 17
#define UART2_RX_Pin 16

//SPI Bus
#define SPI_MoSi_Pin 23
#define SPI_MiSo_Pin 19
#define SPI_SCK_Pin 18
#define SPI_SS_Pin 5



//Devices Setup


#if (FeatureEnable_PiSo_Control == true)
  ButtonPISO buttonpiso1(BUTTONPISO_DataIn, BUTTONPISO_Clk, BUTTONPISO_PL);
#endif



Adafruit_SH1106 display(OLED_SDA, OLED_SCL);


#if defined(ESP32)
//#include <HardwareSerial.h>
//HardwareSerial ExtraSerial0(0);//ESP32Serial0
//HardwareSerial ExtraSerial1(1);//ESP32Serial1
//HardwareSerial ExtraSerial2(2);//ESP32Serial2

#endif





#include "LoRa_E220.h"
#define ENABLE_RSSI true
#define FREQUENCY_915
#define E220_22


//https://github.com/xreef/EByte_LoRa_E220_Series_Library


LoRa_E220 e220ttl(&Serial2);  // e22 TX e22 RX

//#include "EByte_LoRa_E220_library.h"



//Devices Setup Complete

#define buttonPISOcount 8

//Byjunction
char buttonNameString[buttonPISOcount][7] =
{
  "UP",
  "Start",
  "Select",
  "A",
  "LEFT",
  "DOWN",
  "RIGHT",
  "B"
};

//https://www.alt-codes.net/arrow_alt_codes.php
char* returnButtonName(byte buttonID, byte opMode = 2) {
  /* Using the string table in program memory requires the use of special functions to retrieve the data.
       The strcpy_P function copies a string from program space to a string in RAM ("buffer").
       Make sure your receiving string in RAM  is large enough to hold whatever
       you are retrieving from program space. */
  
  if (buttonID < 0){
    return NULL;
  }
  if (buttonID >= buttonPISOcount){
    return NULL;
  }
  if (buttonID >= 8){
    return NULL;
  }
  #define rBN_BASE false
  #define rBN_DPAD true
  byte buttonDPADorBASE_Mask = 0b01110001;//0 = BASE, 1 = DPAD //order = MSB //(76543210)
  //byte buttonDPAD_MaskIndex[4] = {0, 6, 5, 4};//up, Right, Down, Left
  //byte buttonBASE_MaskIndex[4] = {1, 2, 3, 7};//Start, Select, A, B
  byte buttonID_NibbleMaskIndex[8] = {0, 0, 1, 2, 3, 2, 1, 3};//up, Start, Select, A, Left, Down, Right, B
  char* buttonDPAD_Symbols[2][4+1] = {"↑→↓←", "▲►▼◄"};
  char buttonBASE_Symbols[4+1] = "+-AB";
  //char* button_Symbols[3][4+1] = {"↑→↓←", "▲►▼◄", "+-AB"};
  
  switch (opMode) {
  case 0:
  case 1:
    switch (bitRead(buttonDPADorBASE_Mask, buttonID)) {
      case rBN_BASE:
        return (char*)buttonBASE_Symbols[ buttonID_NibbleMaskIndex[ buttonID ] ];
        break;
      case rBN_DPAD:
        return buttonDPAD_Symbols[ opMode ][ buttonID_NibbleMaskIndex[ buttonID ] ];
        break;
      default:
        return NULL;
        break;
    }
    break;
  case 2:
    return buttonNameString[buttonID];
    break;
  default:
    return NULL;
    break;
  }
}
unsigned int returnButtonID(char* buttonName) {
  for (unsigned int i = 0; i < ARRAY_LEN(buttonNameString); i++) {
    if (buttonNameString[i] == buttonName) {
      return i;
    }
  }

}



#define maxDebugCommandScan 1024

#define maxDebugCommandLength 256
//https://www.arduino.cc/reference/en/language/variables/utilities/progmem/
#include <pgmspace.h>
const char debugCommand_0[] PROGMEM = "";
const char debugCommand_1[] PROGMEM = "";
const char debugCommand_2[] PROGMEM = "";
const char debugCommand_3[] PROGMEM = "";
const char debugCommand_4[] PROGMEM = "";
const char debugCommand_5[] PROGMEM = "";
const char debugCommand_6[] PROGMEM = "";
const char debugCommand_7[] PROGMEM = "";
const char debugCommand_8[] PROGMEM = "";
const char debugCommand_9[] PROGMEM = "";
const char debugCommand_10[] PROGMEM = "";
const char debugCommand_11[] PROGMEM = "";
const char debugCommand_12[] PROGMEM = "";
const char debugCommand_13[] PROGMEM = "";
const char debugCommand_14[] PROGMEM = "";
const char debugCommand_15[] PROGMEM = "";
const char debugCommand_16[] PROGMEM = "";
const char debugCommand_17[] PROGMEM = "";
const char debugCommand_18[] PROGMEM = "";
const char debugCommand_19[] PROGMEM = "";
const char debugCommand_20[] PROGMEM = "";
const char debugCommand_21[] PROGMEM = "";
const char debugCommand_22[] PROGMEM = "";
const char debugCommand_23[] PROGMEM = "";
const char debugCommand_24[] PROGMEM = "";
const char debugCommand_25[] PROGMEM = "";
const char debugCommand_26[] PROGMEM = "";
const char debugCommand_27[] PROGMEM = "";
const char debugCommand_28[] PROGMEM = "";
const char debugCommand_29[] PROGMEM = "";
const char debugCommand_30[] PROGMEM = "";
const char debugCommand_31[] PROGMEM = "";

// Then set up a table to refer to your strings.
const char* const debugCommand_List[] PROGMEM = {debugCommand_0, debugCommand_1, debugCommand_2, debugCommand_3, debugCommand_4, debugCommand_5, debugCommand_6, debugCommand_7, debugCommand_8, debugCommand_9, debugCommand_10, debugCommand_11, debugCommand_12, debugCommand_13, debugCommand_14, debugCommand_15, debugCommand_16, debugCommand_17, debugCommand_18, debugCommand_19, debugCommand_20, debugCommand_21, debugCommand_22, debugCommand_23, debugCommand_24, debugCommand_25, debugCommand_26, debugCommand_27, debugCommand_28, debugCommand_29, debugCommand_30, debugCommand_31};

char debugCommandBuffer[maxDebugCommandLength];    // make sure this is large enough for the largest string it must hold







#if (FeatureEnable_SH1106_Display==true)
#if (SH1106_LCDHEIGHT != 64)
#error("Height incorrect, please fix Adafruit_SH1106.h!");
#endif
#endif

#include "Imagebitmap_functions.hpp"


//Debug Based
byte showDebugMenu = 0;//0 = no debug menu, 1= first debug menu, etc
bool disableButtonPISO_update = false;

//System Variables
unsigned int currentMenuID = 0;
unsigned int previousMenuID = 0;
unsigned long frameCountVariable;//This variable stores the number of frames that have been displayed since the program started.
IMGbitmapStruct batteryIconBig;
static unsigned char* batteryIconBigImage; //batteryBig_Full.bmp //SmallBatteryPercent.bmp
static unsigned int batteryIconBigWidth;
static unsigned int batteryIconBigHeight;
int cursorXPos = 0;
int cursorYPos = 0;
long int frameStartTime;// micros()
long int frameEndTime;// micros()
double system_Frame_FPS;


//selection menu //currentMenuID==1
static int sm_selectedID = 0;
static char smOptionName_List[][32 + 1] = {
  "Main Menu",
  "Selection Menu",
  "LoRa Menu Unfinished",
  "Wifi Menu Unfinished",
  "BT Menu Unfinished",
  "IR Menu Unfinished",
  "Sensor Menu Unfinished",
  "Mic/Biz Menu Unfinished",
  "SPIFFS File System Unfinished",
  "SD File System Menu Unfinished",
  "IP Menu",
  "Composite Video Test",
  "Op12",
  "Op13",
  "Op14",
  "Op15",
  "Op15",
  "Op16",
  "Op17",
  "Op18",
  "Op19",
  "Op20",
  "Op21",
  "Op22",
  "Op23",
  "Op24",
  "Op25",
  "Op26",
  "Op27",
  "Op28",
  "Op29",
  "Op30",
  "Op31",
};


//Wifi Menu //currentMenuID==3
static unsigned long lastScanTimer;


//SPIFFs menu //currentMenuID==8






//character variables
const unsigned int characterPixelWidth = 32;//4 bytes
const unsigned int characterPixelHeight = 56;
const unsigned int characterFrameByteSize = ((characterPixelWidth % 8 + characterPixelWidth) >> 3) * characterPixelHeight;
const unsigned int characterBufferFrameCount = 32;
//static unsigned char visableCharacterBuffer[ characterBufferFrameCount ][ characterFrameByteSize ];
IMGbitmapStruct visableCharacterBuffer[ characterBufferFrameCount ];

//Sprite Storage/Memory (_gMSB)(__GMSB__)
const unsigned int spritePagePixelWidth = 1024;
const unsigned int spritePagePixelHeight = 1024;
const byte spritePagePixelData_Bit_Length = 1;
#define CAL_BUFF_BYTE_SIZE__GMSB__(pixW, pixH, pixDataBitL) ( int(pixW/((8)/pixDataBitL))*pixH )//(PixelWidth, PixelHeight, PixelData_Bit_Length)
unsigned int calculateBufferByteSize_gMSB( unsigned int pixW, unsigned int pixH, byte pixDataBitL ){return ( int(pixW/((8)/pixDataBitL))*pixH );};


static unsigned char global_Master_Sprite_Buffer[ CAL_BUFF_BYTE_SIZE__GMSB__( spritePagePixelWidth, spritePagePixelHeight, spritePagePixelData_Bit_Length ) ];






//battery Variabls
static unsigned int batteryXpos = 99;
static unsigned int batteryYpos = 1;
static volatile bool autoUPdateBatteryVariables = true;//used for Debuging
static volatile byte batteryPercent = 100;//out of 100
static volatile double batteryVoltage = 0;
static volatile bool chargingFlag = false;

//cable Icon Variables
byte cableStatus = 0;

//user Settings
byte taskbarRotation = 1;//1
int frame_location_offset = 16;

//timeSettings
//time(), gmtime(), localtime(), mktime(), gettimeofday()
//https://lastminuteengineers.com/esp32-ntp-server-date-time-tutorial/
const char* ntpServer = "pool.ntp.org";
const long  gmtOffset_sec = (-5)*60*60;
const int   daylightOffset_sec = 3600;
bool timeConfigured = false;


void printLocalTime(Stream &serialport){
  struct tm timeinfo;
  if(!getLocalTime(&timeinfo)){
    serialport.println("Failed to obtain time");
    return;
  }
  serialport.println(&timeinfo, "%A, %B %d %Y %H:%M:%S");
  serialport.print("Day of week: ");
  serialport.println(&timeinfo, "%A");
  serialport.print("Month: ");
  serialport.println(&timeinfo, "%B");
  serialport.print("Day of Month: ");
  serialport.println(&timeinfo, "%d");
  serialport.print("Year: ");
  serialport.println(&timeinfo, "%Y");
  serialport.print("Hour: ");
  serialport.println(&timeinfo, "%H");
  serialport.print("Hour (12 hour format): ");
  serialport.println(&timeinfo, "%I");
  serialport.print("Minute: ");
  serialport.println(&timeinfo, "%M");
  serialport.print("Second: ");
  serialport.println(&timeinfo, "%S");

