TerrienDJV5/Netogatchi-ESP32-V1/Software/tamagotchi_V0.0.0_for_Hardware_V1/tamagotchi_V0.0.0_for_Hardware_V1.ino
  serialport.println("Time variables");
  char timeHour[3];
  strftime(timeHour,3, "%H", &timeinfo);
  serialport.println(timeHour);
  char timeWeekDay[10];
  strftime(timeWeekDay,10, "%A", &timeinfo);
  serialport.println(timeWeekDay);
  serialport.println();
}



/*

   Sprites Sheet and Tiles Sheet

*/


static const unsigned char PROGMEM rotateImageTestIcon[] =
{
  B11111111, B11111111, B00000000, B00000000,
  B10000000, B00000001, B00000000, B00000000,
  B10000000, B00000001, B00000000, B00000000,
  B10000000, B00000001, B00000000, B00000000,
  B10000000, B00000001, B00000000, B00000000,
  B10000000, B00000001, B00000000, B00000000,
  B10000000, B00000001, B00000000, B00000000,
  B10000000, B00000001, B00000000, B00000000,
  B10000000, B11111111, B00000000, B00000000,
  B10000000, B10000001, B00000000, B00000000,
  B10000000, B10000001, B00000000, B00000000,
  B10000000, B10000001, B00000000, B00000000,
  B10000000, B10000001, B00000000, B00000000,
  B10000000, B10000001, B00000000, B00000000,
  B10000000, B10000001, B00000000, B00000000,
  B11111111, B11111111, B00000000, B00000000,
  B00000000, B00000000, B00000000, B00000001,
  B00000000, B00000000, B00000000, B00000001,
  B00000000, B00000000, B00000000, B00000001,
  B00000000, B00000000, B00000000, B00000001,
  B00000000, B00000000, B00000000, B00000001,
  B00000000, B00000000, B00000000, B00000001,
  B00000000, B00000000, B00000000, B00000001,
  B00000000, B00000000, B00000000, B00000001,
  B00000000, B00000000, B00000000, B00000001,
  B00000000, B00000000, B00000000, B11111111,
  B00000000, B00000000, B00000000, B11111111,
  B00000000, B00000000, B00000000, B11111111,
  B00000000, B00000000, B00000000, B11111111,
  B00000000, B00000000, B00000000, B11111111,
  B00000000, B00000000, B00000000, B11111111,
  B00000000, B00000000, B11111111, B11111111
};

static const unsigned char PROGMEM wifi16x16Icon[] =
{
  B11111111, B11111111,
  B10000000, B00000001,
  B10000000, B00000001,
  B10000000, B00000001,
  B10000000, B00000001,
  B10000000, B00000001,
  B10000000, B00000001,
  B10000000, B00000001,
  B10000000, B00000001,
  B00000000, B00000000,
  B00000000, B00000000,
  B00011111, B11111000,
  B00111000, B00011100,
  B00110011, B11001100,
  B00000111, B11100000,
  B00000111, B11100000,
};

static const unsigned char PROGMEM LoRa16x16Icon[] =
{
  B11000000, B00000000,
  B11000000, B00000000,
  B11000000, B00000000,
  B11000000, B00000000,
  B11000000, B00000000,
  B11000000, B00000000,
  B11000000, B00000000,
  B11000000, B00000000,
  B11000000, B00000000,
  B11000000, B00000000,
  B11000000, B00000000,
  B11000000, B00000000,
  B11000000, B00000000,
  B11000000, B00000000,
  B11111111, B11111111,
  B11111111, B11111111,
};

/*

   End of Sprites Sheet and Tiles Sheet

*/








/*
 * showPrePrint (Can Be used anyWhere!)
 */
void showPrePrint(Stream &serialport, char* textInput){
  const unsigned int prePrintSize = 32;
  char *prePrintText;
  prePrintText = (char*)malloc(prePrintSize+1);
  memset(prePrintText, '\0', prePrintSize+1);
  if (strlen(textInput) >= prePrintSize){
    strncpy(prePrintText, textInput, prePrintSize);
  }else{
    strncpy(prePrintText, textInput, strlen(textInput));
  }
  serialport.print( prePrintText );
  free(prePrintText);
}



/*
 * WiFi Stuff Start
 */


IPAddress ip(192, 168, 0, 50);
IPAddress gateway(192, 168, 0, 1);
IPAddress subnet(255, 255, 255, 0);

IPAddress local_IP(192, 168, 4, 22);
IPAddress local_gateway(192, 168, 4, 9);
IPAddress local_subnet(255, 255, 255, 0);


unsigned int countNewLinesFromFile(const char *filePath, fs::FS &fs){
  // Open file for reading
  File file = fs.open(filePath, FILE_READ);
  unsigned int newLineCount = 0;
  while(file.available()){
    newLineCount += (file.read()=='\n');
  }
  file.close();
  return newLineCount;
}


typedef struct {
  //six characters are not allowed (SSID): ?, ", $, [, \, ], and +
  char ssid[33];//max length 32 //Min Length 2
  char pass[64];//max length 63
} Credentials_WiFi_Struct;


typedef struct {
  unsigned int length;
  Credentials_WiFi_Struct *credentials;
} List_WiFi_Credentials_Struct;




//https://docs.espressif.com/projects/esp-idf/en/latest/esp32/api-guides/wifi-security.html


const char *filenameWiFi = "/Wifi_Connections.json";
List_WiFi_Credentials_Struct wifiCredentialList;
//make Functions that convert Json to Structs


void disable_STA_WiFi();
void enable_STA_WiFi();




void loadWiFiConfigurationCharArray(char jsonChar[], size_t jsonCharSize, Credentials_WiFi_Struct &wifiCredentials);


// Loads the configuration from a charArray
void loadWiFiConfigurationCharArray(char jsonChar[], size_t jsonCharSize, Credentials_WiFi_Struct &wifiCredentials) {
  // Allocate a temporary JsonDocument
  // Don't forget to change the capacity to match your requirements.
  // Use https://arduinojson.org/v6/assistant to compute the capacity.
  StaticJsonDocument<128> connection;

  // Deserialize the JSON document
  DeserializationError error = deserializeJson(connection, jsonChar);
  if (error)
    Serial.println(F("Failed to read JsonCharArray, using default configuration"));

  // Copy values from the JsonDocument to the Config
  strlcpy(wifiCredentials.pass,                  // <- destination
          connection["pass"] | "",  // <- source
          sizeof(wifiCredentials.pass));         // <- destination's capacity
  strlcpy(wifiCredentials.ssid,                  // <- destination
          connection["ssid"] | "",  // <- source
          sizeof(wifiCredentials.ssid));         // <- destination's capacity
  ;
}


//https://jraleman.medium.com/c-programming-language-functions-malloc-calloc-realloc-and-free-61cfc3e45da7

void saveWiFicredentials(Credentials_WiFi_Struct &wifiCredentials);


//to make Reading and writeing faster checkt this out 
//https://github.com/bblanchon/ArduinoStreamUtils

bool ensureValid_Credentials(Credentials_WiFi_Struct &wifiCredential);
bool ensureValid_SSID(Credentials_WiFi_Struct &wifiCredential);
bool ensureValid_PASS(Credentials_WiFi_Struct &wifiCredential);
bool ensureValid_SSIDchar(char* inputSSID);//Make Private if put in a Class!
bool ensureValid_PASSchar(char* inputPASS);//Make Private if put in a Class!


