TerrienDJV5/Netogatchi-ESP32-V1/Software/tamagotchi_V0.0.0_for_Hardware_V1/tamagotchi_V0.0.0_for_Hardware_V1.ino
void saveWiFiCredentialsList(const char *filename, const List_WiFi_Credentials_Struct &wifiCredentialList, fs::FS &fs);
void loadWiFiCredentialsList(const char *filename, List_WiFi_Credentials_Struct &wifiCredentialList, fs::FS &fs);
void saveWiFiCredentialToWiFiCredentialsList(List_WiFi_Credentials_Struct &wifiCredentialList, Credentials_WiFi_Struct &wifiCredential);
void remove_WiFiCredential_From_WiFiCredentialsList(List_WiFi_Credentials_Struct &wifiCredentialList, Credentials_WiFi_Struct &wifiCredential);



// Saves the CredentialsList to a file
void saveWiFiCredentialsList(const char *filename, const List_WiFi_Credentials_Struct &wifiCredentialList, fs::FS &fs) {
  Serial.println("File Will Be Saved!");
  File file;
  //fs.remove(filename);// Delete existing file, otherwise the configuration is appended to the file
  file = fs.open(filename, FILE_WRITE);// Open file for writing
  
  if (!file) {
    Serial.println(F("Failed to create file"));
    return;
  }
  // Allocate a temporary JsonDocument
  // Don't forget to change the capacity to match your requirements.
  // Use https://arduinojson.org/assistant to compute the capacity.
  DynamicJsonDocument credentialList(128 * wifiCredentialList.length);
  credentialList[ "Length" ] = wifiCredentialList.length;
  for (int index = 0; index < wifiCredentialList.length; index++) {
    Serial.print("index: ");Serial.println(index);
    // Set the values in the document
    credentialList["info"][ index ]["ssid"] = wifiCredentialList.credentials[ index ].ssid;
    credentialList["info"][ index ]["pass"] = wifiCredentialList.credentials[ index ].pass;
    Serial.print("ssid: ");Serial.println(wifiCredentialList.credentials[ index ].ssid);
    Serial.print("pass: ");Serial.println(wifiCredentialList.credentials[ index ].pass);
  }
  serializeJson(credentialList, file);
  serializeJson(credentialList, Serial);
  Serial.println();
  
  // Close the file
  file.close();
}

// Loads the CredentialsList from a file
void loadWiFiCredentialsList(const char *filename, List_WiFi_Credentials_Struct &wifiCredentialList, fs::FS &fs) {
  File file;
  file = fs.open(filename, FILE_READ);// Open file for writing
  Serial.println("File Has Been Read");
  if (!file) {
    Serial.println(F("Failed to create file"));
    return;
  }
  //DynamicJsonDocument credentialList(file.available()*2);
  DynamicJsonDocument credentialList(file.size()*2);
  Serial.println("DynamicJsonDocument");
  //StaticJsonDocument<1024> credentialList;
  //DynamicJsonDocument credentialList(128 * wifiCredentialList.length);
  deserializeJson(credentialList, file);
  Serial.println("deserializeJson");
  
  
  wifiCredentialList.length = credentialList[ "Length" ];
  Serial.println("Length");
  wifiCredentialList.credentials = (Credentials_WiFi_Struct*)calloc(wifiCredentialList.length, sizeof(Credentials_WiFi_Struct));
  Serial.print("length: ");Serial.println(wifiCredentialList.length);
  Serial.println("calloc");
  Credentials_WiFi_Struct temp_wifiCredential;
  unsigned int indexACC = 0;
  for (int index = 0; index < wifiCredentialList.length; index++) {
    Serial.print("index: ");Serial.println(index);
    // Set the values from the document
    strlcpy(temp_wifiCredential.ssid,                  // <- destination
          credentialList["info"][ index ]["ssid"],  // <- source
          sizeof(temp_wifiCredential.ssid));         // <- destination's capacity
    strlcpy(temp_wifiCredential.pass,                  // <- destination
          credentialList["info"][ index ]["pass"],  // <- source
          sizeof(temp_wifiCredential.pass));         // <- destination's capacity
    
    if ( ensureValid_Credentials( temp_wifiCredential ) == false){
      wifiCredentialList.length -= 1;
      continue;
    }
    // Set the values from the document
    strlcpy(wifiCredentialList.credentials[ indexACC ].ssid,                  // <- destination
          credentialList["info"][ index ]["ssid"],  // <- source
          sizeof(wifiCredentialList.credentials[ indexACC ].ssid));         // <- destination's capacity
    strlcpy(wifiCredentialList.credentials[ indexACC ].pass,                  // <- destination
          credentialList["info"][ index ]["pass"],  // <- source
          sizeof(wifiCredentialList.credentials[ indexACC ].pass));         // <- destination's capacity
    Serial.print("ssid: ");Serial.println(wifiCredentialList.credentials[ indexACC ].ssid);
    Serial.print("pass: ");Serial.println(wifiCredentialList.credentials[ indexACC ].pass);
    indexACC++;
  }
  // Close the file
  file.close();
  
  
  //Check if SSID And PASS are Valid
  Serial.println("Checking if Valid!");
  for (int index = 0; index < wifiCredentialList.length; index++) {
    Serial.print("SSID: ");Serial.println(wifiCredentialList.credentials[ index ].ssid);
    Serial.print("PASS: ");Serial.println(wifiCredentialList.credentials[ index ].pass);
  }
  bool credentialsChanged = false;
  for (int index = 0; index < wifiCredentialList.length; index++) {
    if ( ensureValid_Credentials( wifiCredentialList.credentials[ index ] ) ){
      continue;
    }
    credentialsChanged = true;
    remove_WiFiCredential_From_WiFiCredentialsList(wifiCredentialList, wifiCredentialList.credentials[ index ]);
  }
  Serial.println("Checking if Valid!");
  for (int index = 0; index < wifiCredentialList.length; index++) {
    Serial.print("SSID: ");Serial.println(wifiCredentialList.credentials[ index ].ssid);
    Serial.print("PASS: ");Serial.println(wifiCredentialList.credentials[ index ].pass);
  }
  if (credentialsChanged){
    //resaves changed CredentialsList by removing inValided Credentials
    saveWiFiCredentialsList(filename, wifiCredentialList, fs);
  }
}


void saveWiFiCredentialToWiFiCredentialsList(List_WiFi_Credentials_Struct &wifiCredentialList, Credentials_WiFi_Struct &wifiCredential) {
  Serial.println("saveWiFiCredentialToWiFiCredentialsList()");
  //Fix Me?
  bool isINList = false;
  for (int index = 0; index < wifiCredentialList.length; index++) {
    if (strcmp(wifiCredentialList.credentials[ index ].ssid, wifiCredential.ssid)==0){
      strlcpy(wifiCredentialList.credentials[ index ].pass,                  // <- destination
          wifiCredential.pass,  // <- source
          sizeof(wifiCredentialList.credentials[ index ].pass));         // <- destination's capacity
      isINList = true;
      break;
    }
  }
  Serial.print("isINList: ");Serial.println(isINList);
  if (isINList){
    return;
  }
  Credentials_WiFi_Struct *tempCredentials;
  tempCredentials = (Credentials_WiFi_Struct*)calloc(wifiCredentialList.length, sizeof(Credentials_WiFi_Struct));
  for (int index = 0; index < wifiCredentialList.length; index++) {
    strcpy(tempCredentials[ index ].ssid, wifiCredentialList.credentials[ index ].ssid);
    strcpy(tempCredentials[ index ].pass, wifiCredentialList.credentials[ index ].pass);
  }
  Serial.println("Relocating og List");
  wifiCredentialList.length += 1;
  free(wifiCredentialList.credentials);
  wifiCredentialList.credentials = (Credentials_WiFi_Struct*)calloc(wifiCredentialList.length, sizeof(Credentials_WiFi_Struct));
  Serial.println("malloc/calloc/realloc og List Complete");
  for (int index = 0; index < (wifiCredentialList.length - 1); index++) {
    strcpy(wifiCredentialList.credentials[ index ].ssid, tempCredentials[ index ].ssid);
    strcpy(wifiCredentialList.credentials[ index ].pass, tempCredentials[ index ].pass);
  }
  Serial.println("adding New index!");
  strcpy(wifiCredentialList.credentials[ wifiCredentialList.length-1 ].ssid, wifiCredential.ssid);
  strcpy(wifiCredentialList.credentials[ wifiCredentialList.length-1 ].pass, wifiCredential.pass);
  free(tempCredentials);
}



void remove_WiFiCredential_From_WiFiCredentialsList(List_WiFi_Credentials_Struct &wifiCredentialList, Credentials_WiFi_Struct &wifiCredential) {
  Serial.println("remove_WiFiCredential_From_WiFiCredentialsList()");
  for (int index = 0; index < wifiCredentialList.length; index++) {
    Serial.print("SSID: ");Serial.println(wifiCredentialList.credentials[ index ].ssid);
    Serial.print("PASS: ");Serial.println(wifiCredentialList.credentials[ index ].pass);
  }
  Serial.println("Remove");
  Serial.print("SSID: ");Serial.println(wifiCredential.ssid);
  Serial.print("PASS: ");Serial.println(wifiCredential.pass);
  //will remove saved "WiFiCredential" if ssid is on the List!
  bool isINList = false;
  unsigned int selectIndex = 0;
  for (unsigned int index = 0; index < wifiCredentialList.length; index++) {
    if (wifiCredentialList.credentials[ index ].ssid == wifiCredential.ssid){
      isINList = true;
      selectIndex = index;
      break;
    }
  }
  Serial.print("isINList: ");Serial.println(isINList);
  if (!isINList){
    return;
  }
  Serial.println("removing Selected index!");
  //strcpy(wifiCredentialList.credentials[ selectIndex ].ssid, "");
  //strcpy(wifiCredentialList.credentials[ selectIndex ].pass, "");
  wifiCredentialList.length -= 1;
  
