TerrienDJV5/Netogatchi-ESP32-V1/Software/tamagotchi_V0.0.0_for_Hardware_V1/tamagotchi_V0.0.0_for_Hardware_V1.ino
/*
 * WiFi Stuff End
 */









/* Baud-rates available: 300, 600, 1200, 2400, 4800, 9600, 14400, 19200, 28800, 38400, 57600, or 115200, 256000, 512000, 962100

    Protocols available:
   SERIAL_5N1   5-bit No parity 1 stop bit
   SERIAL_6N1   6-bit No parity 1 stop bit
   SERIAL_7N1   7-bit No parity 1 stop bit
   SERIAL_8N1 (the default) 8-bit No parity 1 stop bit
   SERIAL_5N2   5-bit No parity 2 stop bits
   SERIAL_6N2   6-bit No parity 2 stop bits
   SERIAL_7N2   7-bit No parity 2 stop bits
   SERIAL_8N2   8-bit No parity 2 stop bits
   SERIAL_5E1   5-bit Even parity 1 stop bit
   SERIAL_6E1   6-bit Even parity 1 stop bit
   SERIAL_7E1   7-bit Even parity 1 stop bit
   SERIAL_8E1   8-bit Even parity 1 stop bit
   SERIAL_5E2   5-bit Even parity 2 stop bit
   SERIAL_6E2   6-bit Even parity 2 stop bit
   SERIAL_7E2   7-bit Even parity 2 stop bit
   SERIAL_8E2   8-bit Even parity 2 stop bit
   SERIAL_5O1   5-bit Odd  parity 1 stop bit
   SERIAL_6O1   6-bit Odd  parity 1 stop bit
   SERIAL_7O1   7-bit Odd  parity 1 stop bit
   SERIAL_8O1   8-bit Odd  parity 1 stop bit
   SERIAL_5O2   5-bit Odd  parity 2 stop bit
   SERIAL_6O2   6-bit Odd  parity 2 stop bit
   SERIAL_7O2   7-bit Odd  parity 2 stop bit
   SERIAL_8O2   8-bit Odd  parity 2 stop bit
*/
















// Our configuration structure.
//
// Never use a JsonDocument to store the configuration!
// A JsonDocument is *not* a permanent storage; it's only a temporary storage
// used during the serialization phase. See:
// https://arduinojson.org/v6/faq/why-must-i-create-a-separate-config-object/
struct Config {
  char hostname[64];
  int port;
};

void printFile(const char *filename, fs::FS &fs);


const char *filename = "/config.txt";  // <- SD library uses 8.3 filenames
Config config;                         // <- global configuration object

/*
  #define STORAGE_SELECT_SD 0
  #define STORAGE_SELECT_SPIFFS 1
  #define STORAGE_SELECT_SDFAT 2
  #define STORAGE_SELECT_FFAT 3

  #define STORAGE_INCLUDE_SD false
  #define STORAGE_INCLUDE_SPIFFS true
  #define STORAGE_INCLUDE_SDFAT false
  #define STORAGE_INCLUDE_FFAT false
*/

// Loads the configuration from a file
void loadConfiguration(const char *filename, Config &config, byte storageDevice = STORAGE_DEVICE_DEFAULT) {
  // Open file for reading
  File file;
#if (STORAGE_INCLUDE_SD)
  if (storageDevice == STORAGE_SELECT_SD) {
    file = SD.open(filename);
  }
#endif
#if (STORAGE_INCLUDE_SPIFFS)
  if (storageDevice == STORAGE_SELECT_SPIFFS) {
    file = SPIFFS.open(filename);
  }
#endif


  // Allocate a temporary JsonDocument
  // Don't forget to change the capacity to match your requirements.
  // Use https://arduinojson.org/v6/assistant to compute the capacity.
  StaticJsonDocument<512> doc;
  
  // Deserialize the JSON document
  DeserializationError error = deserializeJson(doc, file);
  if (error)
    Serial.println(F("Failed to read file, using default configuration"));

  // Copy values from the JsonDocument to the Config
  config.port = doc["port"] | 2731;
  strlcpy(config.hostname,                  // <- destination
          doc["hostname"] | "example.com",  // <- source
          sizeof(config.hostname));         // <- destination's capacity

  // Close the file (Curiously, File's destructor doesn't close the file)
  file.close();
}


// Saves the configuration to a file
void saveConfiguration(const char *filename, const Config &config, byte storageDevice = STORAGE_DEVICE_DEFAULT) {
  // Delete existing file, otherwise the configuration is appended to the file
#if (STORAGE_INCLUDE_SD)
  if (storageDevice == STORAGE_SELECT_SD) {
    SD.remove(filename);
  }
#endif
#if (STORAGE_INCLUDE_SPIFFS)
  if (storageDevice == STORAGE_SELECT_SPIFFS) {
    SPIFFS.remove(filename);
  }
#endif

  // Open file for writing
  File file;
#if (STORAGE_INCLUDE_SD)
  if (storageDevice == STORAGE_SELECT_SD) {
    file = SD.open(filename, FILE_WRITE);
  }
#endif
#if (STORAGE_INCLUDE_SPIFFS)
  if (storageDevice == STORAGE_SELECT_SPIFFS) {
    file = SPIFFS.open(filename, FILE_WRITE);
  }
#endif


  if (!file) {
    Serial.println(F("Failed to create file"));
    return;
  }

  // Allocate a temporary JsonDocument
  // Don't forget to change the capacity to match your requirements.
  // Use https://arduinojson.org/assistant to compute the capacity.
  StaticJsonDocument<512> doc;
  
  // Set the values in the document
  doc["hostname"] = config.hostname;
  doc["port"] = config.port;
  
  // Serialize JSON to file
  if (serializeJson(doc, file) == 0) {
    Serial.println(F("Failed to write to file"));
  }
  
  // Close the file
  file.close();
}

// Prints the content of a file to the Serial
void printFile(const char *filename, fs::FS &fs) {
  // Open file for reading
  File file;
  file = fs.open(filename);
  
  if (!file) {
    Serial.println(F("Failed to read file"));
    return;
  }

  // Extract each characters by one by one
  while (file.available()) {
    Serial.print((char)file.read());
  }
  Serial.println();

  // Close the file
  file.close();
}







void test_bmp_image_file_read()
{
  File fileBMP;
  printFreeHeap(Serial);
  fileBMP = SPIFFS.open("/gigachad64h_Inverted.bmp");
  IMGbitmapStruct *gigaChadTest = new IMGbitmapStruct;
  printFreeHeap(Serial);
  Serial.println("IMGbitmapStruct Test: Begin");
  
  load_bitmapIMG_File_struct(fileBMP, *gigaChadTest);
  display.clearDisplay();
  display_struct_bitmapIMG(display, *gigaChadTest, 0, 0);
  display.display();
  
  fileBMP.close();
  Serial.println("IMGbitmapStruct Test: Closed");
  delete gigaChadTest;
  printFreeHeap(Serial);

  delay(1000);
  
  printFreeHeap(Serial);
  fileBMP = SPIFFS.open("/SmallBatteryPercent.bmp");
  IMGbitmapStruct *smallbatterypercentTest = new IMGbitmapStruct;
  printFreeHeap(Serial);
  Serial.println("IMGbitmapStruct Test: Begin");
  
  load_bitmapIMG_File_struct(fileBMP, *smallbatterypercentTest);
  display.clearDisplay();
  display_struct_bitmapIMG(display, *smallbatterypercentTest, 0, 0);
  display.display();
  
  fileBMP.close();
  Serial.println("IMGbitmapStruct Test: Closed");
  delete smallbatterypercentTest;
  printFreeHeap(Serial);

  delay(1000);
  
  printFreeHeap(Serial);
  fileBMP = SPIFFS.open("/SmallBatteryPercent_2.bmp");
  IMGbitmapStruct *smallbatterypercent2Test = new IMGbitmapStruct;
  printFreeHeap(Serial);
  Serial.println("IMGbitmapStruct Test: Begin");
  
