TerrienDJV5/Netogatchi-ESP32-V1/Software/tamagotchi_V0.0.0_for_Hardware_V1/tamagotchi_V0.0.0_for_Hardware_V1.ino
  load_bitmapIMG_File_struct(fileBMP, *smallbatterypercent2Test);
  display.clearDisplay();
  display_struct_bitmapIMG(display, *smallbatterypercent2Test, 0, 0);
  display.display();
  
  fileBMP.close();
  Serial.println("IMGbitmapStruct Test: Closed");
  delete smallbatterypercent2Test;
  printFreeHeap(Serial);

  delay(1000);

  
  printFreeHeap(Serial);
  fileBMP = SPIFFS.open("/Neco-Arc_0.bmp");
  IMGbitmapStruct * NecoArcTest = new IMGbitmapStruct;
  printFreeHeap(Serial);
  Serial.println("IMGbitmapStruct Test: Begin");
  
  load_bitmapIMG_File_struct(fileBMP, *NecoArcTest);
  fileBMP.close();
  
  display.clearDisplay();
  display_struct_bitmapIMG(display, *NecoArcTest, 0, 0);
  display.display();
  
  Serial.println("IMGbitmapStruct Test: Closed");
  delete NecoArcTest;
  printFreeHeap(Serial);
}



void test_bitmapgif_dat_FBF()
{
  printFreeHeap(Serial);
  File fileBMP = SPIFFS.open("/boyKisserFaceGif_bitmapgif.dat");
  IMGbitmapStruct boyKisserTest;
  printFreeHeap(Serial);
  Serial.println("IMGbitmapStruct Test: Begin");
  while (fileBMP.available()) {
    load_struct_bitmapIMG_dat_File(fileBMP, boyKisserTest);
    display.clearDisplay();
    display_struct_bitmapIMG(display, boyKisserTest, 0, 0);
    display.display();
  }
  fileBMP.close();
  printFreeHeap(Serial);
}

void test_bitmapgif_dat_GIF()
{
  GIFbitmapStruct boyKisserGIFTest;
  File fileStructBMP;
  fileStructBMP = SPIFFS.open("/boyKisserFaceGif_bitmapgif.dat");
  load_struct_bitmapGIF_dat_File(fileStructBMP, boyKisserGIFTest);
  Serial.println(fileStructBMP);
  fileStructBMP.close();
  
  for(byte frame = 0; frame < boyKisserGIFTest.frameCount; frame++){
    display.clearDisplay();
    display_struct_bitmapGIF(display, boyKisserGIFTest, frame, 0, 0);
    Serial.print("Frame: ");Serial.print(frame);Serial.print("/");Serial.println(boyKisserGIFTest.frameCount);
    display.display();
  }
  //free(boyKisserGIFTest);
  Serial.println("IMGbitmapStruct Test: End");
}




void printParameters(Stream &serialport, struct Configuration configuration);
void printModuleInformation(Stream &serialport, struct ModuleInformation moduleInformation);


void printScrollTextLeft(Adafruit_SH1106 &display, char textInput[], unsigned int textMaxScrollLength, unsigned int frameOffset);





//https://www.freertos.org/a00106.html
TaskHandle_t Task1;
TaskHandle_t Task2;
TaskHandle_t Task3;
TaskHandle_t Task4;
TaskHandle_t Task5;

TaskHandle_t Task6;
TaskHandle_t Task7;
TaskHandle_t Task8;
TaskHandle_t Task9;
TaskHandle_t Task10;


TaskHandle_t TaskIRDecode;
TaskHandle_t Task_WiFi_LoRa_Bridge;
TaskHandle_t TaskWiFiMultiConnect;
TaskHandle_t TaskBuzzer;





//https://forum.arduino.cc/t/how-can-i-do-dual-core-task-use-same-memory-esp32-rtos/702929/24?page=2 //https://youtu.be/ywbq1qR-fY0?t=1206
QueueHandle_t queue;



//https://docs.espressif.com/projects/esp-idf/en/v4.3/esp32s2/api-reference/peripherals/index.html
void setup()   {
  Serial.begin(115200);
  Serial.print("setup() running on core "); Serial.println(xPortGetCoreID());
  printFreeHeap(Serial);
  //https://espressif-docs.readthedocs-hosted.com/projects/arduino-esp32/en/latest/api/preferences.html
  //https://randomnerdtutorials.com/esp32-save-data-permanently-preferences/
  Serial.println( preferences.begin("boyKisser", false, "nvs"));
  preferences.end();
  //setup Pins

  #if (FeatureEnable_IR_RXTX_Control==true)
    //IR Pins
    //pinMode(IR_TX_Pin, OUTPUT);
    IrSender.begin(IR_TX_Pin, ENABLE_LED_FEEDBACK, USE_DEFAULT_FEEDBACK_LED_PIN); // Specify send pin and enable feedback LED at default feedback LED pin
    
    //pinMode(IR_RX_Pin, INPUT);
    IrReceiver.begin(IR_RX_Pin, ENABLE_LED_FEEDBACK); // Start the receiver
  #endif
  
  //MIC Pin
  pinMode(MIC_Pin, INPUT);


  //Buzzer Boi Pin
  //https://github.com/pschatzmann/arduino-audio-tools
  pinMode(buzzerPin, OUTPUT);

  //BatterySensePin
  pinMode(batteryVoltageDivider, INPUT);

  // Startup all pins and UART
  e220ttl.begin();//LoRa Usage



  //Enable Devices
  adc_power_on();

  //https://docs.espressif.com/projects/esp-idf/en/latest/esp32/api-guides/performance/size.html#idf-py-size
  printFreeHeap(Serial);
  #if (FeatureEnable_BT_Serial==true)
    SerialBT.begin("ESP32btSerial"); //Bluetooth device name
    Serial.println("The device started, now you can pair it with bluetooth!");
    printFreeHeap(Serial);
  #endif



  if (!SPIFFS.begin(true)) {
    Serial.println("An Error has occurred while mounting SPIFFS");
    return;
  }
  File file;

  file = SPIFFS.open("/Wifi_Connections.json");
  if (!file) {
    Serial.println("Failed to open file for reading");
    return;
  }

  Serial.println("File Content:");
  while (file.available()) {
    Serial.write(file.read());
  }
  file.close();


  /*
    Dictionary *buttonNamesDict = new Dictionary();//buttonNamesDict
    buttonNamesDict->insert("0", "key_Up");
    buttonNamesDict->insert("1", "key_Start");
    buttonNamesDict->insert("2", "key_Select");
    buttonNamesDict->insert("3", "key_A");
    buttonNamesDict->insert("4", "key_Left");
    buttonNamesDict->insert("5", "key_Down");
    buttonNamesDict->insert("6", "key_Right");
    buttonNamesDict->insert("7", "key_B");
  */


  // by default, we'll generate the high voltage from the 3.3v line internally! (neat!)
  display.begin(SH1106_SWITCHCAPVCC, 0x3C);  // initialize with the I2C addr 0x3D (for the 128x64)
  // init done

  // Show image buffer on the display hardware.
  // Since the buffer is intialized with an Adafruit splashscreen
  // internally, this will display the splashscreen.
  display.display();
  delay(200);

  // Clear the buffer.
  display.stopscroll();
  display.clearDisplay();  
  
  


  /*
   * Startup Tests Starts
   */
  printFreeHeap(Serial);
  delay(1000);
  test_bmp_image_file_read();
  delay(1000);
  printFreeHeap(Serial);
  delay(1000);
  
  test_bitmapgif_dat_FBF();
  
  delay(250);
  test_bitmapgif_dat_GIF();
  
  delay(250);
  
  
  printFreeHeap(Serial);
  
  
  
  
  
  {
  //load boy-kisser from sprite sheet
  Serial.println("-----Load Sprite of Boy-kisser Vertical-----");
  printFreeHeap(Serial);
  File fileBMP;
  fileBMP = SPIFFS.open("/BoyKisserSpriteVertical.bmp");
  IMGbitmapStruct * boyKisserSpriteSheet = new IMGbitmapStruct;
  load_bitmapIMG_File_struct(fileBMP, *boyKisserSpriteSheet);
  fileBMP.close();
  Serial.println("cutSpriteSheet");
  //cut sprite sheet
  IMGbitmapStruct boyKisserFrames[22];
  unsigned int spriteWidth = 85;
  unsigned int spriteHeight = 64;
  for(byte frame = 0; frame < 22; frame++){
    boyKisserFrames[frame].widthPx = spriteWidth;
    boyKisserFrames[frame].heightPx = spriteHeight;
    unsigned int framePaddingLength = (8 - boyKisserFrames[frame].widthPx%8);
    unsigned int widthByteLength = ((8 - (boyKisserFrames[frame].widthPx % 8)) + boyKisserFrames[frame].widthPx) >> 3;
    //create images
    boyKisserFrames[frame].imageByteLength = ( widthByteLength )*boyKisserFrames[frame].heightPx;
    //boyKisserFrames[frame].pixelBitDataArray = (unsigned char*)malloc( boyKisserFrames[frame].imageByteLength );
    boyKisserFrames[frame].allocate(spriteWidth, spriteHeight);
    memcpy(boyKisserFrames[frame].pixelBitDataArray, &boyKisserSpriteSheet->pixelBitDataArray[ boyKisserFrames[frame].imageByteLength * frame ], boyKisserFrames[frame].imageByteLength);
  }
  delete boyKisserSpriteSheet;
  for(byte frame = 0; frame < 22; frame++){
    display.clearDisplay();
    display_struct_bitmapIMG(display, boyKisserFrames[frame], 0, 0);
    display.display();
    delay(100);
  }
  
  printFreeHeap(Serial);
  Serial.println("-----Continuing from Sprite of Boy-kisser Vertical-----");
  delay(1000);
  }
  
  delay(1000);
  
  bool rotTest = true;//true;
  if (rotTest)
  {
  //"/boyKisserFaceGif_bitmapgif.txt"
  File fileBMP;
  fileBMP = SPIFFS.open("/boyKisserFaceGif_bitmapgif.txt");
  if (!fileBMP) {
    Serial.println("Failed to open file for reading");
    return;
  }
  Serial.println("File Content:");
  
  
  //init buffers
  char filereadBuffer[2048];
  char fileImageBuffer[2048];
  memset(filereadBuffer, '\0', 2048);
  memset(fileImageBuffer, '\0', 2048);
  //image Basic Test Loop
  while (fileBMP.available()) {
    fileBMP.readBytesUntil('\n', filereadBuffer, 2048);
    fileBMP.readBytesUntil('\n', fileImageBuffer, 2048);
    display.clearDisplay();
    display.drawBitmap(0, 0, convertTextHextoCharArray( fileImageBuffer ), 85, 64, WHITE);//Test Image Read
    ///*
    printFreeHeap(Serial);
    unsigned char* rotateImageTest;
    rotateImageTest = (unsigned char *) calloc(4 * 32, sizeof(unsigned char *)); //32*32
    bitmapIMGmanipulate0.rotateBitImageClockwise( rotateImageTest, (unsigned char*)rotateImageTestIcon, 32, 32);//rotates 90 deg clockwise //new Px Width and Height will be flipped
    display.drawBitmap(90, 0, rotateImageTest, 32, 32, WHITE);//Test Image Read
    //*/
    display.display();
    Serial.println("Displayed");
    //delay(2000);
    ///*
    printFreeHeap(Serial);
    unsigned char* betterRotateImageTest;
    betterRotateImageTest = (unsigned char *) calloc(16 * 128, sizeof(unsigned char *)); //85*64
    Serial.println("CheckPoint");
    bitmapIMGmanipulate0.rotateBitImageClockwise( betterRotateImageTest, convertTextHextoCharArray( fileImageBuffer ), 85, 64);//rotates 90 deg clockwise //new Px Width and Height will be flipped
    display.clearDisplay();
    display.drawBitmap(0, 0, betterRotateImageTest, 64, 85, WHITE);//Test Image Read
    display.display();
    free(betterRotateImageTest);
    //*/
    //delay(2000);
  }
  fileBMP.close();
  }

  printFreeHeap(Serial);
  /*
   * Startup Tests Ends
   */

