TerrienDJV5/Netogatchi-ESP32-V1/Software/tamagotchi_V0.0.0_for_Hardware_V1/tamagotchi_V0.0.0_for_Hardware_V1.ino
  /*
   * Load Sprites Start
   */
  {
    File fileBMP;
    fileBMP = SPIFFS.open("/batteryBig_Full.bmp");
    load_bitmapIMG_File_struct(fileBMP, batteryIconBig);
    fileBMP.close();
  }
  {
    File fileBMP;
    fileBMP = SPIFFS.open("/Neco-Arc_0.bmp");
    load_bitmapIMG_File_struct(fileBMP, visableCharacterBuffer[ 0 ]);
    fileBMP.close();
  }
  
  /*
   * Load Sprites End
   */
  
  
  display.clearDisplay();
#ifdef _TEST_ADAFRUIT_SH1106
  setupTest(disptestBitFramelay);
#endif
  
  // Should load default config if run for the first time
  Serial.println(F("Loading configuration..."));
  loadConfiguration(filename, config);

  // Create configuration file
  Serial.println(F("Saving configuration..."));
  saveConfiguration(filename, config);

  // Dump config file
  Serial.println(F("Print config file..."));
  printFile(filename, SPIFFS);
  
  
  
  Serial.println("Starting WiFi Setup!");
  Serial.print("Setting soft-AP configuration ... ");
  Serial.println(WiFi.softAPConfig(local_IP, local_gateway, local_subnet) ? "Ready" : "Failed!");
  
  //WiFi Setup
  //https://www.upesy.com/blogs/tutorials/how-to-connect-wifi-acces-point-with-esp32
  //disable_STA_WiFi();
  //enable_STA_WiFi();
  
  WiFi.onEvent(OnWiFiEvent);

  
  printFile("/Wifi_Connections.json", SPIFFS);
  //Load WiFiCredentialsList
  Serial.println(F("Loading WiFi configuration..."));
  loadWiFiCredentialsList("/Wifi_Connections.json", wifiCredentialList, SPIFFS);
  //Save WiFiCredentialsList
  Serial.println(F("Saving WiFi configuration..."));
  saveWiFiCredentialsList("/Wifi_Connections.json", wifiCredentialList, SPIFFS);
  printFile("/Wifi_Connections.json", SPIFFS);
  
  Serial.println(F("Reading WiFi configuration..."));
  
  for (int index = 0; index < wifiCredentialList.length; index++) { 
    Serial.print("ssid: ");Serial.println(wifiCredentialList.credentials[ index ].ssid);
    Serial.print("pass: ");Serial.println(wifiCredentialList.credentials[ index ].pass);
    // Fix me
    wifiMulti.addAP(wifiCredentialList.credentials[ index ].ssid, wifiCredentialList.credentials[ index ].pass);
    Serial.println();
    delay(100);
  }
  
  startSoftAP( Serial );
  SerialWiFiserver.begin();
  //WiFi Setup Complete
  Serial.println("Complete WiFi Setup!");
  
  
  
  // Connect to Wi-Fi using wifiMulti (connects to the SSID with strongest connection)
  Serial.println("Connecting Wifi...");
  ///*
  if(wifiMulti.run() == WL_CONNECTED) {
    Serial.println("");
    Serial.println("WiFi connected");
    Serial.println("IP address: ");
    Serial.println(WiFi.localIP());
  }
  //*/
  
  
  /////FTP Setup, ensure SPIFFS is started before ftp;  /////////
  
  /////FTP Setup, ensure SPIFFS is started before ftp;  /////////
#ifdef ESP32       //esp32 we send true to format spiffs if cannot mount
  if (SPIFFS.begin(true)) {
#elif defined ESP8266
  if (SPIFFS.begin()) {
#endif
      Serial.println("SPIFFS opened!");
      ftpSrv.begin("esp8266","esp8266");    //username, password for ftp.  set ports in ESP8266FtpServer.h  (default 21, 50009 for PASV)
  } 
  
  
  /*
     Task Handles
  */
  //create a task that will be executed in the Task1code() function, with priority 1 and executed on core 0
  xTaskCreatePinnedToCore(
    Task1code,   /* Task function. */
    "BatteryStatusCheck",     /* name of task. */
    2048,       /* Stack size of task */
    NULL,        /* parameter of the task */
    5,           /* priority of the task */
    &Task1,      /* Task handle to keep track of created task */
    0);          /* pin task to core 0 */
  delay(500);

  //create a task that will be executed in the Task2code() function, with priority 6 and executed on core 0
  xTaskCreatePinnedToCore(
    Task2code,   /* Task function. */
    "GetTime",     /* name of task. */
    4096,       /* Stack size of task */
    NULL,        /* parameter of the task */
    6,           /* priority of the task */
    &Task2,      /* Task handle to keep track of created task */
    0);          /* pin task to core 0 */
  delay(500);

  //create a task that will be executed in the Task3code() function, with priority 99 and executed on core 0
  xTaskCreatePinnedToCore(
    TaskIRDecodeFunc,   /* Task function. */
    "TaskIRDecodeFunc",     /* name of task. */
    1000,       /* Stack size of task */
    NULL,        /* parameter of the task */
    99,           /* priority of the task */
    &TaskIRDecode,      /* Task handle to keep track of created task */
    0);          /* pin task to core 0 */
  delay(500);
  
  //create a task that will be executed in the Task3code() function, with priority 2 and executed on core 0
  xTaskCreatePinnedToCore(
    TaskWiFiLoRaBridgeFunc,   /* Task function. */
    "TaskWiFiLoRaBridgeFunc",     /* name of task. */
    2000,       /* Stack size of task */
    NULL,        /* parameter of the task */
    2,           /* priority of the task */
    &Task_WiFi_LoRa_Bridge,      /* Task handle to keep track of created task */
    0);          /* pin task to core 0 */
  delay(500);

  //create a task that will be executed in the Task3code() function, with priority 99 and executed on core 0
  xTaskCreatePinnedToCore(
    TaskWiFiMultiConnectFunc,   /* Task function. */
    "TaskWiFiMultiConnectFunc",     /* name of task. */
    2000,       /* Stack size of task */
    NULL,        /* parameter of the task */
    99,           /* priority of the task */
    &TaskWiFiMultiConnect,      /* Task handle to keep track of created task */
    0);          /* pin task to core 0 */
  delay(500);

  
  

  printFreeHeap(Serial);
  Serial.println("Exiting Setup!");
  delay(1250);
}

//https://techtutorialsx.com/2017/05/06/esp32-arduino-creating-a-task/
//https://docs.espressif.com/projects/esp-idf/en/latest/esp32/api-reference/system/freertos_idf.html

void Task1code( void * pvParameters ) {
  Serial.print("Task1 running on core "); Serial.println(xPortGetCoreID());
  //BatteryStatusCheck
  double vin;
  double maxVin;
  double minVin;
  for (;;) {
    if (autoUPdateBatteryVariables){
      //Calculate Battery Percentage
      
      vin = calculateVoltageDivider(100000, 100000, batteryVoltageDivider);
      maxVin = 4.1;
      minVin = 3.3;
      /*
      double vin = calculateVoltageDivider(100000, 100000, batteryVoltageDivider);
      double maxVin = 4.1;
      double minVin = 3.3;
      //*/
      batteryPercent = (byte)mapdouble((double)vin, (double)minVin, (double)maxVin, (double)0.0, (double)100.0);
      batteryVoltage = vin;
      chargingFlag = false;
      //Serial.print("batteryPercent%:");Serial.println(batteryPercent);
    }
    delay(1000);
  }
  Serial.println("Ending Task1");
  vTaskDelete( NULL );
}

