TerrienDJV5/Netogatchi-ESP32-V1/Software/tamagotchi_V0.0.0_for_Hardware_V1/tamagotchi_V0.0.0_for_Hardware_V1.ino
    //UP
    display.fillRect(bGUIButtonPos.x+5+0, bGUIButtonPos.y+0+0, 4, 4, WHITE);
    display.fillRect(bGUIButtonPos.x+5+1, bGUIButtonPos.y+0+1, 2, 2, BLACK);
    //LEFT
    display.fillRect(bGUIButtonPos.x+0+0, bGUIButtonPos.y+5+0, 4, 4, WHITE);
    display.fillRect(bGUIButtonPos.x+0+1, bGUIButtonPos.y+5+1, 2, 2, BLACK);
    //DOWN
    display.fillRect(bGUIButtonPos.x+5+0, bGUIButtonPos.y+5+0, 4, 4, WHITE);
    display.fillRect(bGUIButtonPos.x+5+1, bGUIButtonPos.y+5+1, 2, 2, BLACK);
    //RIGHT
    display.fillRect(bGUIButtonPos.x+10+0, bGUIButtonPos.y+5+0, 4, 4, WHITE);
    display.fillRect(bGUIButtonPos.x+10+1, bGUIButtonPos.y+5+1, 2, 2, BLACK);
    
    //A
    display.fillRect(bGUIButtonPos.x+16+0, bGUIButtonPos.y+5+0, 4, 4, WHITE);
    display.fillRect(bGUIButtonPos.x+16+1, bGUIButtonPos.y+5+1, 2, 2, BLACK);
    //B
    display.fillRect(bGUIButtonPos.x+21+0, bGUIButtonPos.y+2+0, 4, 4, WHITE);
    display.fillRect(bGUIButtonPos.x+21+1, bGUIButtonPos.y+2+1, 2, 2, BLACK);
    
    if (buttonpiso1.isPressed(0) == true) {//UP
      //UP
      display.fillRect(bGUIButtonPos.x+5+0, bGUIButtonPos.y+0+0, 4, 4, WHITE);
    };
    if (buttonpiso1.isPressed(1) == true) {//Start
      //Start
      display.fillRect(bGUIButtonPos.x+11+0, bGUIButtonPos.y+0+0, 4, 4, WHITE);
    };
    if (buttonpiso1.isPressed(2) == true) {//Select
      //Select
      display.fillRect(bGUIButtonPos.x+16+0, bGUIButtonPos.y+0+0, 4, 4, WHITE);
    };
    if (buttonpiso1.isPressed(3) == true) {//A
      //A
      display.fillRect(bGUIButtonPos.x+16+0, bGUIButtonPos.y+5+0, 4, 4, WHITE);
    };
    if (buttonpiso1.isPressed(4) == true) {//LEFT
      //LEFT
      display.fillRect(bGUIButtonPos.x+0+0, bGUIButtonPos.y+5+0, 4, 4, WHITE);
    };
    if (buttonpiso1.isPressed(5) == true) {//DOWN
      //DOWN
      display.fillRect(bGUIButtonPos.x+5+0, bGUIButtonPos.y+5+0, 4, 4, WHITE);
    };
    if (buttonpiso1.isPressed(6) == true) {//RIGHT
      //RIGHT
      display.fillRect(bGUIButtonPos.x+10+0, bGUIButtonPos.y+5+0, 4, 4, WHITE);
    };
    if (buttonpiso1.isPressed(7) == true) {//B
      //B
      display.fillRect(bGUIButtonPos.x+21+0, bGUIButtonPos.y+2+0, 4, 4, WHITE);
    };
  }
  
  //update Frame
  display.display();
  //update frame count variable
  frameCountVariable++;
  //update frame End Time
  frameEndTime = micros();
}





/*
void display_connected_devices()
{
  //https://www.upesy.com/blogs/tutorials/how-create-a-wifi-acces-point-with-esp32
    wifi_sta_list_t wifi_sta_list;
    tcpip_adapter_sta_list_t adapter_sta_list;
    esp_wifi_ap_get_sta_list(&wifi_sta_list);
    tcpip_adapter_get_sta_list(&wifi_sta_list, &adapter_sta_list);

    if (adapter_sta_list.num > 0)
        Serial.println("-----------");
    for (uint8_t i = 0; i < adapter_sta_list.num; i++)
    {
        tcpip_adapter_sta_info_t station = adapter_sta_list.sta[i];
        Serial.print((String)"[+] Device " + i + " | MAC : ");
        Serial.printf("%02X:%02X:%02X:%02X:%02X:%02X", station.mac[0], station.mac[1], station.mac[2], station.mac[3], station.mac[4], station.mac[5]);
        Serial.println((String) " | IP " + ip4addr_ntoa(&(station.ip)));
    }
}
//*/





void printScrollTextLeft(Adafruit_SH1106 &display, char textInput[], unsigned int textMaxScrollLength, unsigned int frameOffset)
{
  //uses (Standard ASCII 5x7 font) for Charater size.
  //char textInput[]; //Text Input
  //unsigned int textMaxScrollLength; //Length of Text from Input to scroll!
  //unsigned int frameOffset; //global frame count since start
  const byte charaSX = 5;
  const byte charaSY = 7;
  //currently only can only scroll from start to end going Left.
  unsigned int frameStartScroll_Index = 0;//specify what frame the function was first called.
  /*
   * The Start frame the scroll math will be base off will always be 0
   */
  byte pixelSpeedFrame = 1;//how many pixels does the text move in a single frame!
  unsigned int localFrameOffset = frameOffset - frameStartScroll_Index;
  if (frameOffset < frameStartScroll_Index){
    localFrameOffset = 0;
  }
  //fix sync issue
  //Work on (oct 20 2023)
  bool printDebugText = false;
  if (printDebugText){
    Serial.printf("-----FUNC(printScrollTextLeft(display, %s, %i, %i))-----\n", textInput, textMaxScrollLength, frameOffset );
  }
  char textInputShort[textMaxScrollLength+1];
  unsigned int maxlocalFrame = ((strlen(textInput)-textMaxScrollLength)*(charaSX*pixelSpeedFrame));
  unsigned int localFrame = (localFrameOffset)%(maxlocalFrame);
  unsigned int textStartIndex = (localFrame)/(charaSX*pixelSpeedFrame);
  if (printDebugText){
    Serial.printf("maxlocalFrame= %d\n", maxlocalFrame);
    Serial.printf("localFrame= %d\n", localFrame);
    Serial.printf("textStartIndex= %d, textInputShort= \"%s\"\n", textStartIndex, textInputShort);
  }
  memset(textInputShort, '\0', textMaxScrollLength+1);
  strncpy(textInputShort, &textInput[ textStartIndex ], textMaxScrollLength);
  if (printDebugText){
    Serial.printf("&textInput[ textStartIndex = %d ]= \"%s\" = textInputShort= \"%s\", textMaxScrollLength= %d \n", textStartIndex, &textInput[ textStartIndex ], textInputShort, textMaxScrollLength);
  }
  unsigned int setCursorX = display.getCursorX() - localFrame%(charaSX*pixelSpeedFrame);
  unsigned int setCursorY = display.getCursorY();
  if (printDebugText){
    Serial.printf("setCursorX= %d , setCursorY= %d, textInputShort= \"%s\"\n", setCursorX, setCursorY, textInputShort);
  }
  display.setCursor(setCursorX, setCursorY);
  display.println(textInputShort);
}

void printFreeHeap(Stream &serialport) {
  bool showMSGIdentifierOnPrint = false;
  if (showMSGIdentifierOnPrint){
    serialport.print("-----ESP_STAT-----");
  }
  //-----ESP_STAT-----
  serialport.print("ESP.getFreeHeap():");
  serialport.println(ESP.getFreeHeap());
}

void printHeapFrag(Stream &serialport) {
  bool showMSGIdentifierOnPrint = false;
  if (showMSGIdentifierOnPrint){
    serialport.print("-----ESP_STAT-----");
  }
  //-----ESP_STAT-----
  serialport.print("HeapFrag:"); serialport.print(getFragmentation()); serialport.print("%"); serialport.println();
}  

void menu_MAIN(){
  display.clearDisplay();
  {
    display.drawRoundRect(0, 2 - 8, 128, 16 - 2 + 8, 4, WHITE);
    display.fillRect(0, 0, 48 + 8, 16, BLACK);
    display.drawLine(0, 7, 47, 7, WHITE);
    display.drawLine(47, 7, 47 + 8, 7 + 8, WHITE);
  }
  {
    display_struct_bitmapIMG(display, batteryIconBig, batteryXpos, batteryYpos);
    //display.drawBitmap(batteryXpos, batteryYpos, batteryIconBigImage, batteryIconBigWidth, batteryIconBigHeight, WHITE);
    if (batteryVoltage == 0.0){
      display.fillRect(batteryXpos + 4, batteryYpos + 2, 20, 8, BLACK);
    }else{
      display.fillRect(batteryXpos + 4, batteryYpos + 2, (double)((batteryPercent) * (20 / 100)), 8, BLACK);
    }
  }
  
  display.fillRect(80, 0, 16, 16+16, BLACK);
  if ((WiFi.getMode() == WIFI_MODE_STA) or (WiFi.getMode() == WIFI_MODE_APSTA)) {
    display.fillRect(80, 0, 16, 16, WHITE);
    display.drawBitmap(80, 0, wifi16x16Icon, 16, 16, BLACK);
    if (WiFi.status() == WL_CONNECTED) {
      display.fillRect(80, 0, 16, 16, BLACK);
      display.drawBitmap(80, 0, wifi16x16Icon, 16, 16, WHITE);
    }
  }
  if ((WiFi.getMode() == WIFI_MODE_AP) or (WiFi.getMode() == WIFI_MODE_APSTA)) {
    display.drawBitmap(80, 16, wifi16x16Icon, 16, 16, WHITE);
  }
  //batteryPercent, chargingFlag
  display.setCursor(0, 0);
  display.setTextSize(1);
  display.setTextColor(WHITE);
  display.print("FPS~:"); display.print( system_Frame_FPS ); display.println();
  //display.print("RawButtons:"); display.println(buttonpiso1.getRAWState(), BIN);
  display.print("battery:"); display.print(batteryPercent); display.print("%, "); display.print(batteryVoltage); display.println("V");
  display.print("ShowingVCB_frame:"); display.println(frameCountVariable % characterBufferFrameCount);
  display_struct_bitmapIMG(display, visableCharacterBuffer[ frameCountVariable % characterBufferFrameCount ], 0, 8);
  //display.drawBitmap(0, 8, visableCharacterBuffer[ frameCountVariable % 32 ], 32, 56, WHITE);
}


void menu_SELECTION(){
  display.clearDisplay();
  int buttonDrawCount = 4;
  int buttonDrawWidth = display.width() - 2;
  int buttonDrawHeight = 16;//display.height()/4;
  int optionNameID = 0;
  unsigned int printBufferSize = 18;//33
  char printOptionsBuffer[ printBufferSize ];
  memset(printOptionsBuffer, '\0', printBufferSize);
  static int oN_IDDisplay_offset;
  
  if (buttonpiso1.isTapped(0) == true) {//UP
    sm_selectedID--;
    if (sm_selectedID + 1 == oN_IDDisplay_offset) {
      oN_IDDisplay_offset = sm_selectedID;
    };
  };
  if (buttonpiso1.isTapped(5) == true) {//DOWN
    sm_selectedID++;
    if ((sm_selectedID - oN_IDDisplay_offset) == buttonDrawCount) {
      oN_IDDisplay_offset = sm_selectedID - (buttonDrawCount - 1);
    };
  };
  if (buttonpiso1.isTapped(2) == true) {//Select
    currentMenuID = sm_selectedID;
  };
  for (int buttonDrawIndex = 0; buttonDrawIndex < buttonDrawCount; buttonDrawIndex++) {
    optionNameID = oN_IDDisplay_offset + buttonDrawIndex;
    display.setCursor(4, 4 + buttonDrawHeight * buttonDrawIndex);
    display.setTextSize(1.5);
    if ((sm_selectedID) != optionNameID) {
      display.drawRoundRect(0, buttonDrawHeight * buttonDrawIndex, buttonDrawWidth, buttonDrawHeight - 2, buttonDrawHeight / 4, WHITE);
      display.setTextColor(WHITE);
    } else {
      display.fillRoundRect(0, buttonDrawHeight * buttonDrawIndex, buttonDrawWidth, buttonDrawHeight - 2, buttonDrawHeight / 4, WHITE);
      display.setTextColor(BLACK);
    };
    strlcpy(printOptionsBuffer, smOptionName_List[ optionNameID ], printBufferSize);
    display.print(optionNameID); display.print(":"); display.println(printOptionsBuffer);
  }
}



  

void menu_LORA(){
  //ToDo: make this its own Loop And only breakOut of it if the (currentMenuID!=2)
  //Work On me
  display.clearDisplay();
  //https://github.com/xreef/EByte_LoRa_E220_Series_Library
  display.setCursor(0, 1 * 8);
  display.setTextSize(1);
  display.setTextColor(WHITE);
  display.print("LoRa Menu"); display.println();
  //https://cplusplus.com/reference/string/string/
  static String timeLog;
  static String messageLog;
  String message;
  // If something available
  if (e220ttl.available() > 1) {
    Serial.println("Message received!");
    display.println("Message received!");
    // read the String message
    #ifdef ENABLE_RSSI
    ResponseContainer rc = e220ttl.receiveMessageRSSI();
    #else
    ResponseContainer rc = e220ttl.receiveMessage();
    #endif
    
