TerrienDJV5/Netogatchi-ESP32-V1/Software/tamagotchi_V0.0.0_for_Hardware_V1/tamagotchi_V0.0.0_for_Hardware_V1.ino
    // Is something goes wrong print error
    if (rc.status.code != 1) {
      Serial.println(rc.status.getResponseDescription());
      display.println(rc.status.getResponseDescription());
    } else {
      struct tm timeinfo;
      if(!getLocalTime(&timeinfo)){
        Serial.println("Failed to obtain time");
      }
      Serial.println(&timeinfo, "%A, %B %d %Y %H:%M:%S");
      char timeInfoChar[64+1];
      strftime(timeInfoChar,64+1, "%A, %B %d %Y %H:%M:%S", &timeinfo);
      Serial.println(timeInfoChar);
      timeLog = timeInfoChar;
      messageLog = rc.data;
      // Print the data received
      Serial.println(rc.status.getResponseDescription());
      Serial.println(rc.data);
      Serial.println(rc.data[0], DEC);//IDK
      Serial.println(rc.data[1], DEC);//IDK
      Serial.println(rc.data[2], DEC);//channel
      display.println(rc.status.getResponseDescription());
      display.println(rc.data);
      #ifdef ENABLE_RSSI
      Serial.print("RSSI: "); Serial.println(rc.rssi, DEC);
      display.print("RSSI: "); display.println(rc.rssi, DEC);
      #endif
    }
    {
      // Send message
      //ResponseStatus rs = e220ttl.sendBroadcastFixedMessage(0, 0, 0x17, &messaggione, sizeof(Messaggione));
      ResponseStatus rs = e220ttl.sendBroadcastFixedMessage(0x17, "Message Received!");
      // Check If there is some problem of succesfully send
      Serial.println(rs.getResponseDescription());
    }
    {
      String input = "Oh, i bet you like kissing boys, boykisser!";
      e220ttl.sendMessage(input);
    }
    
  }
  display.println("MessageLog: ");
  display.print(timeLog);
  display.println();
  
  display.print("\"");
  display.print(messageLog);
  display.print("\"");
  display.println();
  display.setCursor(0, 5 * 8);
  display.display();
}

void menu_SPIFFS(){
  display.clearDisplay();
  //https://techtutorialsx.com/2019/02/23/esp32-arduino-list-all-files-in-the-spiffs-file-system/
  display.setCursor(0, 1 * 8);
  display.setTextSize(1);
  display.setTextColor(WHITE);
  display.print("SPIFFs Menu"); display.println();
  unsigned int fileCount = 0;
  int fileSelect = 0;
  unsigned int fileDisplayOffset = 0;
  unsigned int fileDisplayOffsetMax = 7;
  unsigned int currentNameSaveCount = 8;
  unsigned int extendNameSaveCountSize = 4;
  unsigned int maxFileNameLength = 32;
  char *savedFileNames;
  char *savedFileNamesExtendBuffer;
  savedFileNames = (char *)malloc( currentNameSaveCount * maxFileNameLength );
  memset(savedFileNames, '\0', currentNameSaveCount * maxFileNameLength);
  Serial.println("CheckPoint-00");
  File root = SPIFFS.open("/");
  printDirectory(root, 0);
  Serial.println("CheckPoint-01");
  free(savedFileNames);
}

void printDirectory(File dir, int numTabs) {
  while (true) {
    File entry =  dir.openNextFile();
    if (! entry) {
      // no more files
      break;
    }
    for (uint8_t i = 0; i < numTabs; i++) {
      Serial.print('\t');
    }
    Serial.print(entry.name());
    if (entry.isDirectory()) {
      Serial.println("/");
      printDirectory(entry, numTabs + 1);
    } else {
      // files have sizes, directories do not
      Serial.print("\t\t");
      Serial.print(entry.size(), DEC);
      Serial.print("\t --> ");
      Serial.print(numTabs);
      Serial.println();
    }
    entry.close();
  }
}


void menu_WIFI(){
  display.clearDisplay();
  //https://randomnerdtutorials.com/esp32-useful-wi-fi-functions-arduino/
  //https://arduino-esp8266.readthedocs.io/en/latest/esp8266wifi/soft-access-point-class.html
  display.setCursor(0, 1 * 8);
  display.setTextSize(1);
  display.setTextColor(WHITE);
  display.print("WiFi Menu"); display.println();
  if (buttonpiso1.isTapped(3) == true) {//A
    if (WiFi.getMode() == WIFI_MODE_NULL) {
      enable_STA_WiFi();
    } else {
      disable_STA_WiFi();
    }
  }
  if (WiFi.status() == WL_CONNECTED) {
    Serial.println("WiFi connected");
    Serial.println("IP address: ");
    Serial.println(WiFi.localIP());
  }
  if (WiFi.status() != WL_CONNECTED) {
    if (WiFi.getMode() != WIFI_MODE_NULL) {
      int n;
      int showOnScreenConnection = 7;
      if ((millis() - lastScanTimer) > 60000) {
        n = WiFi.scanNetworks();
        lastScanTimer = millis();
      }
      display.print("Connections: "); display.println(n);
      for (int index = 0; index < n; index++) {
        display.print(WiFi.SSID(index)); display.print(" RRSI: "); display.println(WiFi.RSSI(index));
      }
    }
  }
  
  const char preSetCharArray[16] = "WiFi.getMode()";
  Serial.print( preSetCharArray );Serial.print(":"); Serial.print(WiFi.getMode()); Serial.print(", ");
  switch (WiFi.getMode()){
    case (WIFI_MODE_NULL):
      Serial.print( preSetCharArray );Serial.println(" == WIFI_MODE_NULL");
      break;
    case (WIFI_MODE_STA):
      Serial.print( preSetCharArray );Serial.println(" == WIFI_MODE_STA");
      break;
    case (WIFI_MODE_AP):
      Serial.print( preSetCharArray );Serial.println(" == WIFI_MODE_AP");
      break;
    case (WIFI_MODE_APSTA):
      Serial.print( preSetCharArray );Serial.println(" == WIFI_MODE_APSTA");
      break;
    case (WIFI_MODE_MAX):
      Serial.print( preSetCharArray );Serial.println(" == WIFI_MODE_MAX");
      break;
    default:
      Serial.print( preSetCharArray );Serial.print(" == ");Serial.print( WiFi.getMode() );Serial.println();
      break;
  }
}

void menu_IR(){
  display.clearDisplay();
  display.setCursor(0, 0);
  display.setTextSize(1);
  display.setTextColor(WHITE);
  display.print("IR Menu"); display.println();
  display.print("Functionality Not yet added!"); display.println();
}

void menu_IP(){
  display.clearDisplay();
  display.setCursor(0, 0);
  display.setTextSize(1);
  display.setTextColor(WHITE);
  display.print("IP Menu"); display.println();
  display.print("AP IP address: "); display.print( WiFi.softAPIP() ); display.println();
}







/*
 * ToDo: recode serial Debug Commands to allow easier additions of new commands
 * idea(1): make a index list of commands where commands have indexes and thus can be used in a switch case tree
 */

void checkAllDebugInputs(){
  //https://arduino.stackexchange.com/questions/31256/multiple-client-server-over-wifi
  //Make Serial Debug command into Function in order for usage with both SerialBT and Serial
  serialDebugCommands(Serial);
#if (FeatureEnable_BT_Serial==true)
  serialDebugCommands(SerialBT);
#endif


  // listen for incoming clients
  if (!SerialWiFiclient.connected()) {
    SerialWiFiclient = SerialWiFiserver.available();
  }
  Serial.print("Client Connected:"); Serial.print(SerialWiFiclient.connected()); Serial.print(" Client available:"); Serial.print(SerialWiFiclient.available()); Serial.println();


  //MAX_SERIAL_WIFI_CLIENTS
  if (SerialWiFiclient) {
    if (SerialWiFiclient.connected()) {
      Serial.println("Connected to Serial client");
      serialDebugCommands(SerialWiFiclient);
    }
    // close the connection:
    //client.stop();
  }
  
  if (WiFi.getMode() != WIFI_MODE_NULL) {
    if (WiFi.getMode() != WIFI_MODE_AP) {
      Serial.print("Local IP address: "); Serial.println(WiFi.localIP());
    };
    if (WiFi.getMode() != WIFI_MODE_STA) {
      Serial.print("SoftAP IP address: "); Serial.println(WiFi.softAPIP());
    };
  }
}



#define MAXDEBUG_TARGETCOMMAND_LENGTH 64
#define MAXDEBUG_COMMANDINPUT_LENGTH 256
#define MAXDEBUG_SUBTARGETCOMMAND_LENGTH 256
#define MAXDEBUG_SUBCOMMANDINPUT_LENGTH 256
class DebugCommands {
  public:
    //buffers
    char targetCommand[ MAXDEBUG_TARGETCOMMAND_LENGTH ];
    char commandInputs[ MAXDEBUG_COMMANDINPUT_LENGTH ];
    char subTargetCommand[ MAXDEBUG_SUBTARGETCOMMAND_LENGTH ];
    char subCommandInputs[ MAXDEBUG_SUBCOMMANDINPUT_LENGTH ];
};


//https://forum.arduino.cc/t/can-you-pass-a-serial-port-as-a-parameter/658755
void serialDebugCommands(Stream &serialport)
{
  //get serial debug command!
  if (serialport.available() != 0) {
    String debugCommandString = serialport.readString();  //read until timeout
    debugCommandString.trim();// remove any \r \n whitespace at the end of the String
    char debugCommand[ debugCommandString.length() + 1 ]; //maxDebugCommandScan
    debugCommandString.toCharArray(debugCommand, debugCommandString.length() + 1);
    //https://docs.arduino.cc/built-in-examples/communication/ASCIITable

    //Decode serial debug command!
    int debugCommandLength = strlen(debugCommand);
    //init Buffers
    char targetCommand[ MAXDEBUG_TARGETCOMMAND_LENGTH ];
    char commandInputs[ MAXDEBUG_COMMANDINPUT_LENGTH ];
    char subTargetCommand[ MAXDEBUG_SUBTARGETCOMMAND_LENGTH ];
    char subCommandInputs[ MAXDEBUG_SUBCOMMANDINPUT_LENGTH ];
    
    printCharArrayValue(serialport, debugCommand, "Debug Command");

    serial_WiFi_DebugCommands(serialport, debugCommand);
    serial_LoRa_DebugCommands(serialport, debugCommand);
    serial_ButtonPISO_DebugCommands(serialport, debugCommand);
    
