TerrienDJV5/Netogatchi-ESP32-V1/Software/tamagotchi_V0.0.0_for_Hardware_V1/tamagotchi_V0.0.0_for_Hardware_V1.ino
      readFile(serialport, SPIFFS, "/Wifi_Connections.json");
      serialport.println("Wifi Credentials Saved!");
      ESP.restart();
    }
    if (commandSelect(commandInputs, "CredentialRemove ")) {
      //command format: control WiFi CredentialRemove "SSID" "PassWord"
      strcpy(subTargetCommand, "CredentialRemove ");
      strcpy(subCommandInputs, &commandInputs[strlen(subTargetCommand)]);
      printCharArrayValue(serialport, subCommandInputs, "subCommandInputs");
      
      const char ch0 = '"';
      char *pointer0;
      char *pointer1;
      char *pointer2;
      char *pointer3;
      unsigned int pSize0;
      unsigned int pSize1;
      unsigned int pSize2;
      unsigned int pSize3;
      char STA_SSID[33];
      char STA_PASS[64];
      memset(STA_SSID, '\0', 33);
      memset(STA_PASS, '\0', 64);
      pointer0 = strchr(subCommandInputs, ch0);
      pSize0 = strlen(pointer0);
      pointer1 = strchr(&pointer0[1], ch0);
      pSize1 = strlen(pointer1);
      pointer2 = strchr(&pointer1[1], ch0);
      pSize2 = strlen(pointer2);
      pointer3 = strchr(&pointer2[1], ch0);
      pSize3 = strlen(pointer3);
      
      serialport.printf("Looling For: |%c|\n", ch0);
      serialport.printf("Pointer0: |%s| Len=%d\n", pointer0, pSize0);
      serialport.printf("Pointer1: |%s| Len=%d\n", pointer1, pSize1);
      serialport.printf("Pointer2: |%s| Len=%d\n", pointer2, pSize2);
      serialport.printf("Pointer3: |%s| Len=%d\n", pointer3, pSize3);
      
      strncpy(STA_SSID, &pointer0[1], pSize0-pSize1-1);
      strncpy(STA_PASS, &pointer2[1], pSize2-pSize3-1);
      serialport.printf("STA_SSID: |%s|\n", STA_SSID);
      serialport.printf("STA_PASS: |%s|\n", STA_PASS);
      
      serialport.println("Saving Wifi Credentials!");
      Credentials_WiFi_Struct wifiCredential;
      strcpy(wifiCredential.ssid, STA_SSID);
      strcpy(wifiCredential.pass, STA_PASS);
      readFile(serialport, SPIFFS, "/Wifi_Connections.json");
      
      //################################################################################################################################
      List_WiFi_Credentials_Struct temp_wifiCredentialList;
      //Load WiFiCredentialsList
      serialport.println(F("Loading WiFi configuration..."));
      serialport.println(wifiCredential.ssid);
      serialport.println(wifiCredential.pass);
      loadWiFiCredentialsList("/Wifi_Connections.json", temp_wifiCredentialList, SPIFFS);
      //saveWiFiCredentialToWiFiCredentialsList(temp_wifiCredentialList, wifiCredential);
      remove_WiFiCredential_From_WiFiCredentialsList(temp_wifiCredentialList, wifiCredential);
      saveWiFiCredentialsList("/Wifi_Connections.json", temp_wifiCredentialList, SPIFFS);
      //################################################################################################################################
      
      readFile(serialport, SPIFFS, "/Wifi_Connections.json");
      serialport.println("Wifi Credentials Saved!");
      ESP.restart();
    }
    if (commandSelect(commandInputs, "disconnect")) {
      //command format: control WiFi disconnect
      strcpy(subTargetCommand, "connect ");
      strcpy(subCommandInputs, &commandInputs[strlen(subTargetCommand)]);
      printCharArrayValue(serialport, subCommandInputs, "subCommandInputs");
      
      WiFi.disconnect(true);  // Disconnect from the network
      serialport.println("Wifi Disconnected!");
    }
    if (commandSelect(commandInputs, "checkSavedInfo")) {
      //command format: control WiFi checkSavedInfo
      strcpy(subTargetCommand, "checkSavedInfo ");
      strcpy(subCommandInputs, &commandInputs[strlen(subTargetCommand)]);
      printCharArrayValue(serialport, subCommandInputs, "subCommandInputs");
      
      readFile(serialport, SPIFFS, "/Wifi_Connections.json");
      serialport.println("checkSavedInfo!");
    }
  }

}





bool commandSelect(char* commandCheck, char* commandSelect) {
  return (strncmp(commandCheck, commandSelect, strlen(commandSelect)) == 0);
}

void serialPrintMessageFrom(char *messageSorce, char *message) {
  Serial.print(messageSorce);
  Serial.print(": ");
  Serial.print(message);
  Serial.println();
}


void printCharArrayValue(Stream &serialport, char *charArrayValue, char *charArrayName)
{
  //using this function when possible can save Program Space
  serialport.print(charArrayName);
  serialport.print(":");
  serialport.print(char(34));
  serialport.print(charArrayValue);
  serialport.print(char(34));
  serialport.println();
}




void printLoRaConfig(Stream &serialport, LoRa_E220 &e220ttl)
{
  //https://mischianti.org/2022/04/19/ebyte-lora-e220-llcc68-device-for-arduino-esp32-or-esp8266-configuration-3/
  // Startup all pins and UART
  //e220ttl.begin();//LoRa Usage

  //https://mischianti.org/2022/04/19/ebyte-lora-e220-llcc68-device-for-arduino-esp32-or-esp8266-configuration-3/
  ResponseStructContainer c;
  c = e220ttl.getConfiguration();
  // It's important get configuration pointer before all other operation
  Configuration configuration = *(Configuration*) c.data;
  serialport.println(c.status.getResponseDescription());
  serialport.println(c.status.code);

  printParameters(serialport, configuration);

  ResponseStructContainer cMi;
  cMi = e220ttl.getModuleInformation();
  // It's important get information pointer before all other operation
  ModuleInformation mi = *(ModuleInformation*)cMi.data;

  serialport.println(cMi.status.getResponseDescription());
  serialport.println(cMi.status.code);

  printModuleInformation(serialport, mi);
  c.close();
}



//https://mischianti.org/2022/04/19/ebyte-lora-e220-llcc68-device-for-arduino-esp32-or-esp8266-configuration-3/

void printParameters(Stream &serialport, struct Configuration configuration) {
  serialport.println("----------------------------------------");
  
  serialport.print(F("HEAD : "));  serialport.print(configuration.COMMAND, HEX); serialport.print(" "); serialport.print(configuration.STARTING_ADDRESS, HEX); serialport.print(" "); serialport.println(configuration.LENGHT, HEX);
  serialport.println(F(" "));
  serialport.print(F("AddH : "));  serialport.println(configuration.ADDH, HEX);
  serialport.print(F("AddL : "));  serialport.println(configuration.ADDL, HEX);
  serialport.println(F(" "));
  serialport.print(F("Chan : "));  serialport.print(configuration.CHAN, DEC); serialport.print(" -> "); serialport.println(configuration.getChannelDescription());
  serialport.println(F(" "));
  serialport.print(F("SpeedParityBit     : "));  serialport.print(configuration.SPED.uartParity, BIN); serialport.print(" -> "); serialport.println(configuration.SPED.getUARTParityDescription());
  serialport.print(F("SpeedUARTDatte     : "));  serialport.print(configuration.SPED.uartBaudRate, BIN); serialport.print(" -> "); serialport.println(configuration.SPED.getUARTBaudRateDescription());
  serialport.print(F("SpeedAirDataRate   : "));  serialport.print(configuration.SPED.airDataRate, BIN); serialport.print(" -> "); serialport.println(configuration.SPED.getAirDataRateDescription());
  serialport.println(F(" "));
  serialport.print(F("OptionSubPacketSett: "));  serialport.print(configuration.OPTION.subPacketSetting, BIN); serialport.print(" -> "); serialport.println(configuration.OPTION.getSubPacketSetting());
  serialport.print(F("OptionTranPower    : "));  serialport.print(configuration.OPTION.transmissionPower, BIN); serialport.print(" -> "); serialport.println(configuration.OPTION.getTransmissionPowerDescription());
  serialport.print(F("OptionRSSIAmbientNo: "));  serialport.print(configuration.OPTION.RSSIAmbientNoise, BIN); serialport.print(" -> "); serialport.println(configuration.OPTION.getRSSIAmbientNoiseEnable());
  serialport.println(F(" "));
  serialport.print(F("TransModeWORPeriod : "));  serialport.print(configuration.TRANSMISSION_MODE.WORPeriod, BIN); serialport.print(" -> "); serialport.println(configuration.TRANSMISSION_MODE.getWORPeriodByParamsDescription());
  serialport.print(F("TransModeEnableLBT : "));  serialport.print(configuration.TRANSMISSION_MODE.enableLBT, BIN); serialport.print(" -> "); serialport.println(configuration.TRANSMISSION_MODE.getLBTEnableByteDescription());
  serialport.print(F("TransModeEnableRSSI: "));  serialport.print(configuration.TRANSMISSION_MODE.enableRSSI, BIN); serialport.print(" -> "); serialport.println(configuration.TRANSMISSION_MODE.getRSSIEnableByteDescription());
  serialport.print(F("TransModeFixedTrans: "));  serialport.print(configuration.TRANSMISSION_MODE.fixedTransmission, BIN); serialport.print(" -> "); serialport.println(configuration.TRANSMISSION_MODE.getFixedTransmissionDescription());


  serialport.println("----------------------------------------");
}
void printModuleInformation(Stream &serialport, struct ModuleInformation moduleInformation) {
  serialport.println(F("----------------------------------------"));
  serialport.print(F("HEAD: "));  serialport.print(moduleInformation.COMMAND, HEX); serialport.print(" "); serialport.print(moduleInformation.STARTING_ADDRESS, HEX); serialport.print(" "); serialport.println(moduleInformation.LENGHT, DEC);

  serialport.print(F("Model no.: "));  serialport.println(moduleInformation.model, HEX);
  serialport.print(F("Version  : "));  serialport.println(moduleInformation.version, HEX);
  serialport.print(F("Features : "));  serialport.println(moduleInformation.features, HEX);
  serialport.println(F("----------------------------------------"));

