TerrienDJV5/Netogatchi-ESP32-V1/Software/tamagotchi_V0.0.0_for_Hardware_V1/tamagotchi_V0.0.0_for_Hardware_V1.ino
}







void printButtonPISODebug() {
  //delay(100);
  if (buttonpiso1.isPressed(0) == true) {//UP
    Serial.println("Button 0 was Pressed!");
  };
  if (buttonpiso1.isPressed(1) == true) {//Start
    Serial.println("Button 1 was Pressed!");
  };
  if (buttonpiso1.isPressed(2) == true) {//Select
    Serial.println("Button 2 was Pressed!");
  };
  if (buttonpiso1.isPressed(3) == true) {//A
    Serial.println("Button 3 was Pressed!");
  };
  if (buttonpiso1.isPressed(4) == true) {//LEFT
    Serial.println("Button 4 was Pressed!");
  };
  if (buttonpiso1.isPressed(5) == true) {//DOWN
    Serial.println("Button 5 was Pressed!");
  };
  if (buttonpiso1.isPressed(6) == true) {//RIGHT
    Serial.println("Button 6 was Pressed!");
  };
  if (buttonpiso1.isPressed(7) == true) {//B
    Serial.println("Button 7 was Pressed!");
  };
}


// Computes the heap fragmentation percentage.
//inline float getFragmentation() {
float getFragmentation() {
  //https://github.com/bblanchon/cpp4arduino/blob/master/HeapFragmentation/MemoryInfo.h
  //https://docs.espressif.com/projects/esp-idf/en/latest/esp32/api-reference/system/heap_debug.html
  return 100 - heap_caps_get_largest_free_block(MALLOC_CAP_8BIT) * 100.0 / heap_caps_get_total_size(MALLOC_CAP_8BIT);
}



double calculateVoltageDivider(unsigned long r1, unsigned long r2, unsigned int pinSelect)
{
  //voltage Divider
  //https://randomnerdtutorials.com/esp32-adc-analog-read-arduino-ide/
  //unsigned long r1 = 100000;//connects to Battery(vin)
  //unsigned long r2 = 100000;//connects to gnd
  unsigned int pinValue = analogRead(pinSelect);//0-4095//0V - 3.3V
  double resistors;
  double vout;
  double vin;
  vout = mapdouble((double)pinValue, (double)0, (double)4095, (double)0.0, (double)3.3);
  resistors = (double(r2) / double(r1 + r2));
  vin = vout / resistors;
  /*
    //vout=vin*(r2/(r1+r2))
    //vin=vout/(r2/(r1+r2))
  */
  /*
    Serial.print("pinValue:");Serial.println(pinValue);
    Serial.print("vout:");Serial.println(vout);
    Serial.print("vin:");Serial.println(vin);
    //*/
  return vin;
};


float mapfloat(float x, float in_min, float in_max, float out_min, float out_max) {
  return (x - in_min) * (out_max - out_min) / (in_max - in_min) + out_min;
}
double mapdouble(double x, double in_min, double in_max, double out_min, double out_max) {
  return (x - in_min) * (out_max - out_min) / (in_max - in_min) + out_min;
}







unsigned char* convertTextHextoCharArray(char *inputHexText) {
  static unsigned char output[ 1024 ];
  memcpy(output, inputHexText, strlen(inputHexText) >> 1);
  unsigned int outputIndex = 0;
  for (uint16_t readIndex = 0; readIndex < strlen(inputHexText); readIndex += 2) {
    char hexChar[3];
    char *ptr;
    strncpy(hexChar, &inputHexText[readIndex], 2);
    hexChar[2] = '\0';
    output[ outputIndex ] = strtoul(hexChar, &ptr, 16);
    outputIndex++;
  }
  return output;
}



unsigned char* readTCAImgF(char *inputHexText) {
  //TCAImgF = Terrien's Custom Animated Image Format
  static unsigned char output[ 1024 ];
  unsigned char fheader[5 + 1] = "tcaif";
  unsigned char fversion[2 + 1] = "00";
  unsigned char spriteName[16 + 1] = "AmongUSisSUSTest";
  uint16_t totalFrameCount = 0;//(0-65535)-> (1-65536)
  uint8_t globalPixelWidth = 0;//(0-255)-> (1-256)
  uint8_t globalPixelHeight = 0;//(0-255)-> (1-256)
  uint8_t imageFormatFlags = B00000000;
  /*
    FileData Structure:
    5 bytes - file header
    2 bytes - file version
    16 bytes - in-program name
    2 bytes - Total Frame Count (1-65536)( tFcount )
    1 byte - Global Pixel Width (1-256)
    1 byte - Global Pixel Height (1-256)
    1 byte - image format flags (6 bools + 2bit value)
    ->B00000001 = Per-Frame Pixel Width&Height Enabled
    ->B00000010 = Per-Frame X&Y Pos Offset Enabled
    ->B00000100 = Per-Frame Delay Enabled
    ->B00001000 = Clear Area before each Frame Enabled
    ---> draws a black square at display location before drawing frame
    ->B00110000 = encoded image rotation
    ---> (Clockwise)( imgEncodeRot )
    ---> used if the encoded image needs to be rotated before stored in memory
    ->B01000000 = loop animation enabled
    ---> ( used if tFcount > 1 )
    ->B10000000 = inverted Image Data flag
    ---> if enabled flip each Pixel bit before output
    Per frame:
    1 byte - Pixel Width (if enabled)( fbitpxw )
    1 byte - Pixel Height (if enabled)( fbitpxh )
    1 byte - Image Xpos offset (if enabled)
    1 byte - Image Ypos offset (if enabled)
    2 bytes - hold Frame Delay before next draw (if enabled) (1-65536 milliseconds)
    2 bytes - Frame Data Bytes Count (fdBytec)
    fdBytec Bytes - Frame Pixel Data

  */

  return output;
}



/*
 * //https://www.tutorialspoint.com/esp32_for_iot/esp32_for_iot_spiffs_storage.htm
 */

void listDir(Stream &serialport, fs::FS &fs, const char * dirname, uint8_t levels){
   serialport.printf("Listing directory: %s\r\n", dirname);

   File root = fs.open(dirname);
   if(!root){
      serialport.println("− failed to open directory");
      return;
   }
   if(!root.isDirectory()){
      serialport.println(" − not a directory");
      return;
   }

   File file = root.openNextFile();
   while(file){
      if(file.isDirectory()){
         serialport.print("  DIR : ");
         serialport.println(file.name());
         if(levels){
            listDir(serialport, fs, file.name(), levels -1);
         }
      } else {
         serialport.print("  FILE: ");
         serialport.print(file.name());
         serialport.print("\tSIZE: ");
         serialport.println(file.size());
      }
      file = root.openNextFile();
   }
}

void readFile(Stream &serialport, fs::FS &fs, const char * path){
   serialport.printf("Reading file: %s\r\n", path);

   File file = fs.open(path);
   if(!file || file.isDirectory()){
       serialport.println("− failed to open file for reading");
       return;
   }

   serialport.println("− read from file:");
   while(file.available()){
      serialport.write(file.read());
   }
}

void writeFile(Stream &serialport, fs::FS &fs, const char * path, const char * message){
   serialport.printf("Writing file: %s\r\n", path);

   File file = fs.open(path, FILE_WRITE);
   if(!file){
      serialport.println("− failed to open file for writing");
      return;
   }
   if(file.print(message)){
      serialport.println("− file written");
   }else {
      serialport.println("− frite failed");
   }
}

void appendFile(Stream &serialport, fs::FS &fs, const char * path, const char * message){
   serialport.printf("Appending to file: %s\r\n", path);

   File file = fs.open(path, FILE_APPEND);
   if(!file){
      serialport.println("− failed to open file for appending");
      return;
   }
   if(file.print(message)){
      serialport.println("− message appended");
   } else {
      serialport.println("− append failed");
   }
}

void renameFile(Stream &serialport, fs::FS &fs, const char * path1, const char * path2){
   serialport.printf("Renaming file %s to %s\r\n", path1, path2);
   if (fs.rename(path1, path2)) {
      serialport.println("− file renamed");
   } else {
      serialport.println("− rename failed");
   }
}

void deleteFile(Stream &serialport, fs::FS &fs, const char * path){
   serialport.printf("Deleting file: %s\r\n", path);
   if(fs.remove(path)){
      serialport.println("− file deleted");
   } else {
      serialport.println("− delete failed");
   }
}
